In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(
    {
        'Name': ['John Smith', 'Jane Doe', 'Mary Hampton'],
        'Gender': ['M', 'F', 'F'],
        'Salary': np.array([70000, 55000, 87000])
     },
    index=[1, 2, 3],
)
df

           Name Gender  Salary
1    John Smith      M   70000
2      Jane Doe      F   55000
3  Mary Hampton      F   87000

In [3]:
df['Salary'] = df['Salary'].astype(np.float32)
df

           Name Gender   Salary
1    John Smith      M  70000.0
2      Jane Doe      F  55000.0
3  Mary Hampton      F  87000.0

In [6]:
# Another way to make a df is using pd.Dataframe.from_dict(dict)
# The difference is that from_dict has another argument "orient".
# orient='columns' -> normal df       orient='index' -> indices as features

data = {'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}
df1 = pd.DataFrame.from_dict(data)
df2 = pd.DataFrame.from_dict(data, orient='index')

In [7]:
df1

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [8]:
df2

   0  1  2
A  1  2  3
B  4  5  6
C  7  8  9

In [9]:
# axis=0 means columns, axis=1 means rows.

df = pd.DataFrame([[1, 2, 3, 4, 5],
                   [10, 20, 30, 40, 50],
                   [100, 200, 300, 400, 500]],
                  columns=['A', 'B', 'C', 'D', 'E'],
                  index=['X', 'Y', 'Z']
)
df

     A    B    C    D    E
X    1    2    3    4    5
Y   10   20   30   40   50
Z  100  200  300  400  500

In [10]:
series1 = pd.Series([5, 10, 20], index=['X', 'Y', 'Z'])
df.add(series1, axis=0)

     A    B    C    D    E
X    6    7    8    9   10
Y   20   30   40   50   60
Z  120  220  320  420  520

In [11]:
series2 = pd.Series([5, 10, 15, 20, 25], index=['A', 'B', 'C', 'D', 'E'])
df.add(series2, axis=1)

     A    B    C    D    E
X    6   12   18   24   30
Y   15   30   45   60   75
Z  105  210  315  420  525

In [12]:
# To get access to display options, use pd.set_option() or pd.options.display.
pd.set_option('display.min_rows', 5)
pd.set_option('display.max_rows', 50)
pd.set_option('display.max_columns', 50)
pd.reset_option('display.min_rows')

pd.options.display.min_rows = 5
pd.options.display.max_rows = 50
pd.options.display.max_columns = 50

pd.reset_option('display.min_rows')
pd.reset_option('display.max_rows')
pd.reset_option('display.max_columns')